redchenjs/auto_curtain_controller_msp430/src/driver/ssd1331.c
/*
 * ssd1331.c
 *
 *  Created on: 2016-10-20
 *      Author: Jack Chen <redchenjs@live.com>
 * 
 * --------SSD1331--------
 * PORT		TYPE	PIN
 * RES		OUT		P3.6
 * DC		OUT		P3.7
 * CS		OUT		P1.4
 * SCK		OUT		P1.5(SPI)
 * MOSI		OUT		P1.7(SPI)
 * -----------------------
 */

#include <msp430.h>

#include "device/spi.h"
#include "driver/ssd1331.h"
#include "system/fonts.h"

#define abs(x)   ((x)>0?(x):-(x))
#define min(a,b) ((a)<(b)?(a):(b))
#define max(a,b) ((a)>(b)?(a):(b))

#define SSD1331_PIN_SET()	P3DIR |= BIT6; P3DIR |= BIT7; P1DIR |= BIT4

#define SSD1331_RES_SET()	P3OUT |= BIT6
#define SSD1331_RES_CLR()	P3OUT &=~BIT6
#define SSD1331_DC_SET()	P3OUT |= BIT7
#define SSD1331_DC_CLR()	P3OUT &=~BIT7
#define SSD1331_CS_SET()	P1OUT |= BIT4
#define SSD1331_CS_CLR()	P1OUT &=~BIT4

#define SSD1331_WRITE_BYTE(__DATA)	spi_transmit_frame(&__DATA, 1)

enum ssd1331_panel_value {
    SSD1331_WIDTH  = 96,
    SSD1331_HEIGHT = 64
};

enum ssd1331_data_type {
    SSD1331_CMD  = 0,
    SSD1331_DATA = 1
};

enum ssd1331_fundamental_command_table {
    SET_COLUMN_ADDRESS  = 0x15,
    SET_ROW_ADDRESS     = 0x75,

    SET_CONTRAST_A          = 0x81,
    SET_CONTRAST_B          = 0x82,
    SET_CONTRAST_C          = 0x83,
    SET_MASTER_CURRENT      = 0x87,
    SET_PRECHARGE_SPEED_A   = 0x8A,
    SET_PRECHARGE_SPEED_B   = 0x8B,
    SET_PRECHARGE_SPEED_C   = 0x8C,

    SET_REMAP_COLOR_DEPTH   = 0xA0,
    SET_DISPLAY_START_LINE  = 0xA1,
    SET_DISPLAY_OFFSET      = 0xA2,

    SET_NORMAL_DISPLAY      = 0xA4,
    SET_ENTIRE_DISPLAY_ON   = 0xA5,
    SET_ENTIRE_DISPLAY_OFF  = 0xA6,
    SET_INVERSE_DISPLAY     = 0xA7,

    SET_MULTIPLEX_RATIO     = 0xA8,
    SET_DIM_MODE            = 0xAB,
    SET_MASTER_CONFIG       = 0xAD,

    SET_DISPLAY_ON_DIM      = 0xAC,
    SET_DISPLAY_OFF         = 0xAE,
    SET_DISPLAY_ON_NORMAL   = 0xAF,

    SET_POWER_SAVE_MODE     = 0xB0,
    SET_PHASE_PERIOD_ADJ    = 0xB1,
    SET_DISPLAY_CLOCK_DIV   = 0xB3,
    SET_GRAY_SCALE_TABLE    = 0xB8,
    SET_BUILTIN_LINEAR_LUT  = 0xB9,
    SET_PRECHARGE_LEVEL     = 0xBB,
    SET_VCOMH_VOLTAGE       = 0xBE,

    SET_COMMAND_LOCK    = 0xFD
};

enum ssd1331_graphic_acceleration_command_table {
    DRAW_LINE       = 0x21,
    DRAW_RECTANGLE  = 0x22,
    COPY_WINDOW     = 0x23,
    DIM_WINDOW      = 0x24,
    CLEAR_WINDOW    = 0x25,
    FILL_WINDOW     = 0x26,

    CONTINUOUS_SCROLLING_SETUP  = 0x27,
    DEACTIVATE_SCROLLING        = 0x2E,
    ACTIVATE_SCROLLING          = 0x2F
};

static void ssd1331_write_byte(unsigned char chData, unsigned char chCmd)
{
    if (chCmd == SSD1331_DATA) {
        SSD1331_DC_SET();
    } else {
        SSD1331_DC_CLR();
    }

    SSD1331_CS_CLR();
    SSD1331_WRITE_BYTE(chData);
    SSD1331_CS_SET();
}

void ssd1331_draw_point(unsigned char chXpos, unsigned char chYpos, unsigned int hwColor)
{
    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    ssd1331_write_byte(SET_COLUMN_ADDRESS, SSD1331_CMD);
    ssd1331_write_byte(chXpos, SSD1331_CMD);
    ssd1331_write_byte(chXpos, SSD1331_CMD);

    ssd1331_write_byte(SET_ROW_ADDRESS, SSD1331_CMD);
    ssd1331_write_byte(chYpos, SSD1331_CMD);
    ssd1331_write_byte(chYpos, SSD1331_CMD);
    
    ssd1331_write_byte(hwColor >> 8, SSD1331_DATA);
    ssd1331_write_byte(hwColor, SSD1331_DATA);
}

void ssd1331_draw_line(unsigned char chXpos0, unsigned char chYpos0, unsigned char chXpos1, unsigned char chYpos1, unsigned int hwColor)
{
    if (chXpos0 >= SSD1331_WIDTH || chYpos0 >= SSD1331_HEIGHT || chXpos1 >= SSD1331_WIDTH || chYpos1 >= SSD1331_HEIGHT) {
        return;
    }

    ssd1331_write_byte(DRAW_LINE, SSD1331_CMD);

    ssd1331_write_byte(chXpos0, SSD1331_CMD);
    ssd1331_write_byte(chYpos0, SSD1331_CMD);
    ssd1331_write_byte(chXpos1, SSD1331_CMD);
    ssd1331_write_byte(chYpos1, SSD1331_CMD);

    ssd1331_write_byte(hwColor >> 10, SSD1331_CMD);
    ssd1331_write_byte(hwColor >> 5, SSD1331_CMD);
    ssd1331_write_byte(hwColor << 1, SSD1331_CMD);
}

void ssd1331_draw_v_line(unsigned char chXpos, unsigned char chYpos, unsigned char chHeight, unsigned int hwColor)
{
    unsigned int y1 = min(chYpos + chHeight, SSD1331_HEIGHT - 1);

    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    ssd1331_write_byte(DRAW_LINE, SSD1331_CMD);

    ssd1331_write_byte(chXpos, SSD1331_CMD);
    ssd1331_write_byte(chYpos, SSD1331_CMD);
    ssd1331_write_byte(chXpos, SSD1331_CMD);
    ssd1331_write_byte(y1, SSD1331_CMD);

    ssd1331_write_byte(hwColor << 1, SSD1331_CMD);
    ssd1331_write_byte(hwColor >> 5, SSD1331_CMD);
    ssd1331_write_byte(hwColor >> 11, SSD1331_CMD);
}

void ssd1331_draw_h_line(unsigned char chXpos, unsigned char chYpos, unsigned char chWidth, unsigned int hwColor)
{
    unsigned int x1 = min(chXpos + chWidth, SSD1331_WIDTH- 1);

    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    ssd1331_write_byte(DRAW_LINE, SSD1331_CMD);

    ssd1331_write_byte(chXpos, SSD1331_CMD);
    ssd1331_write_byte(chYpos, SSD1331_CMD);
    ssd1331_write_byte(x1, SSD1331_CMD);
    ssd1331_write_byte(chYpos, SSD1331_CMD);

    ssd1331_write_byte(hwColor << 1, SSD1331_CMD);
    ssd1331_write_byte(hwColor >> 5, SSD1331_CMD);
    ssd1331_write_byte(hwColor >> 11, SSD1331_CMD);
}

void ssd1331_draw_rect(unsigned char chXpos, unsigned char chYpos, unsigned char chWidth, unsigned char chHeight, unsigned int hwColor)
{
    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    ssd1331_write_byte(FILL_WINDOW, SSD1331_CMD);
    ssd1331_write_byte(0x00, SSD1331_CMD);

    ssd1331_write_byte(DRAW_RECTANGLE, SSD1331_CMD);

    ssd1331_write_byte(chXpos, SSD1331_CMD);
    ssd1331_write_byte(chYpos, SSD1331_CMD);
    ssd1331_write_byte(chXpos + chWidth - 1, SSD1331_CMD);
    ssd1331_write_byte(chYpos + chHeight - 1, SSD1331_CMD);

    ssd1331_write_byte(hwColor >> 10, SSD1331_CMD);
    ssd1331_write_byte(hwColor >> 5, SSD1331_CMD);
    ssd1331_write_byte(hwColor << 1, SSD1331_CMD);

    ssd1331_write_byte(0x00, SSD1331_CMD);
    ssd1331_write_byte(0x00, SSD1331_CMD);
    ssd1331_write_byte(0x00, SSD1331_CMD);
}

void ssd1331_draw_circle(unsigned char chXpos, unsigned char chYpos, unsigned char chRadius, unsigned int hwColor)
{
    int x = -chRadius, y = 0, err = 2 - 2 * chRadius, e2;

