redchenjs/auto_curtain_controller_msp430/src/driver/ssd1331.c
    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    do {
        ssd1331_draw_point(chXpos - x, chYpos + y, hwColor);
        ssd1331_draw_point(chXpos + x, chYpos + y, hwColor);
        ssd1331_draw_point(chXpos + x, chYpos - y, hwColor);
        ssd1331_draw_point(chXpos - x, chYpos - y, hwColor);
        e2 = err;
        if (e2 <= y) {
            err += ++y * 2 + 1;
            if(-x == y && e2 <= x) e2 = 0;
        }
        if(e2 > x) err += ++x * 2 + 1;
    } while (x <= 0);
}

void ssd1331_draw_mono_bitmap(unsigned char chXpos, unsigned char chYpos, const unsigned char *pchBmp, unsigned char chWidth, unsigned char chHeight, unsigned int hwForeColor, unsigned int hwBackColor)
{
    unsigned char i, j, byteWidth = (chWidth + 7) / 8;

    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    ssd1331_write_byte(SET_COLUMN_ADDRESS, SSD1331_CMD);
    ssd1331_write_byte(chXpos, SSD1331_CMD);
    ssd1331_write_byte(chXpos + chWidth - 1, SSD1331_CMD);

    ssd1331_write_byte(SET_ROW_ADDRESS, SSD1331_CMD);
    ssd1331_write_byte(chYpos, SSD1331_CMD);
    ssd1331_write_byte(chYpos + chHeight - 1, SSD1331_CMD);

    for (i = 0; i < chHeight; i++) {
        for (j = 0; j < chWidth; j++) {
            if(*(pchBmp + j * byteWidth + i / 8) & (128 >> (i & 7))) {
                ssd1331_write_byte(hwForeColor >> 8, SSD1331_DATA);
                ssd1331_write_byte(hwForeColor, SSD1331_DATA);
            } else {
                ssd1331_write_byte(hwBackColor >> 8, SSD1331_DATA);
                ssd1331_write_byte(hwBackColor, SSD1331_DATA);
            }
        }
    }
}

void ssd1331_draw_64k_bitmap(unsigned char chXpos, unsigned char chYpos, const unsigned char *pchBmp, unsigned char chWidth, unsigned char chHeight)
{
    unsigned char i, j;

    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    ssd1331_write_byte(SET_COLUMN_ADDRESS, SSD1331_CMD);
    ssd1331_write_byte(chXpos, SSD1331_CMD);
    ssd1331_write_byte(chXpos + chWidth - 1, SSD1331_CMD);

    ssd1331_write_byte(SET_ROW_ADDRESS, SSD1331_CMD);
    ssd1331_write_byte(chYpos, SSD1331_CMD);
    ssd1331_write_byte(chYpos + chHeight - 1, SSD1331_CMD);

    for (i = 0; i < chHeight; i++) {
        for (j = 0; j < chWidth; j++) {
            ssd1331_write_byte(*pchBmp++, SSD1331_DATA);
            ssd1331_write_byte(*pchBmp++, SSD1331_DATA);
        }
    }
}

void ssd1331_fill_rect(unsigned char chXpos, unsigned char chYpos, unsigned char chWidth, unsigned char chHeight, unsigned int hwColor)
{
    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    ssd1331_write_byte(FILL_WINDOW, SSD1331_CMD);
    ssd1331_write_byte(0x01, SSD1331_CMD);

    ssd1331_write_byte(DRAW_RECTANGLE, SSD1331_CMD);

    ssd1331_write_byte(chXpos, SSD1331_CMD);
    ssd1331_write_byte(chYpos, SSD1331_CMD);
    ssd1331_write_byte(chXpos + chWidth - 1, SSD1331_CMD);
    ssd1331_write_byte(chYpos + chHeight - 1, SSD1331_CMD);

    ssd1331_write_byte(hwColor >> 10, SSD1331_CMD);
    ssd1331_write_byte(hwColor >> 5, SSD1331_CMD);
    ssd1331_write_byte(hwColor << 1, SSD1331_CMD);

    ssd1331_write_byte(hwColor >> 10, SSD1331_CMD);
    ssd1331_write_byte(hwColor >> 5, SSD1331_CMD);
    ssd1331_write_byte(hwColor << 1, SSD1331_CMD);

//    SSD1331_DELAY_US(chWidth * chHeight / 8);
}

void ssd1331_fill_gram(unsigned int hwColor)
{
    ssd1331_fill_rect(0x00, 0x00, SSD1331_WIDTH, SSD1331_HEIGHT, hwColor);
}

void ssd1331_clear_rect(unsigned char chXpos, unsigned char chYpos, unsigned char chWidth, unsigned char chHeight)
{
    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    ssd1331_write_byte(CLEAR_WINDOW, SSD1331_CMD);
    ssd1331_write_byte(chXpos, SSD1331_CMD);
    ssd1331_write_byte(chYpos, SSD1331_CMD);
    ssd1331_write_byte(chXpos + chWidth - 1, SSD1331_CMD);
    ssd1331_write_byte(chYpos + chHeight - 1, SSD1331_CMD);

//    SSD1331_DELAY_US(chWidth * chHeight / 8);
}

void ssd1331_clear_gram(void)
{
    unsigned char i, j;

    for (i = 0; i < SSD1331_HEIGHT; i++) {
        for (j = 0; j < SSD1331_WIDTH; j++) {
            ssd1331_draw_point(j, i, Black);
        }
    }
}

void ssd1331_display_char(unsigned char chXpos, unsigned char chYpos, unsigned char chChr, unsigned char chFontIndex, unsigned int hwForeColor, unsigned int hwBackColor)
{
    unsigned char i, j;
    unsigned char chTemp, chYpos0 = chYpos;

    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    for (i = 0; i < fonts_width[chFontIndex] * ((fonts_height[chFontIndex] + 7) / 8); i++) {
        switch (chFontIndex) {
            case FONT_1206:
                chTemp = c_chFont1206[chChr - ' '][i];
                break;
            case FONT_1608:
                chTemp = c_chFont1608[chChr - ' '][i];
                break;
            case FONT_1616:
                chTemp = c_chFont1616[chChr - ' '][i];
                break;
            case FONT_3216:
                chTemp = c_chFont3216[chChr - ' '][i];
                break;
            default:
                chTemp = 0x00;
                break;
        }

        for (j = 0; j < 8; j++) {
            if (chTemp & 0x80) {
                ssd1331_draw_point(chXpos, chYpos, hwForeColor);
            } else {
                ssd1331_draw_point(chXpos, chYpos, hwBackColor);
            }
            chTemp <<= 1;
            chYpos++;

            if ((chYpos - chYpos0) == fonts_height[chFontIndex]) {
                chYpos = chYpos0;
                chXpos++;
                break;
            }
        }
    } 
}

static unsigned long _pow(unsigned char m, unsigned char n)
{
    unsigned long result = 1;

    while (n --) result *= m;
    return result;
}

void ssd1331_display_num(unsigned char chXpos, unsigned char chYpos, unsigned long chNum, unsigned char chLen, unsigned char chFontIndex, unsigned int hwForeColor, unsigned int hwBackColor)
{
    unsigned char i;
    unsigned char chTemp, chShow = 0;

