redchenjs/auto_curtain_controller_msp430/src/driver/ssd1331.c
    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    for (i = 0; i < chLen; i++) {
        chTemp = (chNum / _pow(10, chLen - i - 1)) % 10;
        if (chShow == 0 && i < (chLen - 1)) {
            if(chTemp == 0) {
                ssd1331_display_char(chXpos + fonts_width[chFontIndex] * i, chYpos, ' ', chFontIndex, hwForeColor, hwBackColor);
                continue;
            } else {
                chShow = 1;
            }
        }
        ssd1331_display_char(chXpos + fonts_width[chFontIndex] * i, chYpos, chTemp + '0', chFontIndex, hwForeColor, hwBackColor);
    }
}

void ssd1331_display_string(unsigned char chXpos, unsigned char chYpos, const char *pchString, unsigned char chFontIndex, unsigned int hwForeColor, unsigned int hwBackColor)
{
    if (chXpos >= SSD1331_WIDTH || chYpos >= SSD1331_HEIGHT) {
        return;
    }

    while (*pchString != '\0') {       
        if (chXpos > (SSD1331_WIDTH - fonts_width[chFontIndex])) {
            chXpos = 0;
            chYpos += fonts_height[chFontIndex];
            if (chYpos > (SSD1331_HEIGHT - fonts_height[chFontIndex])) {
                chYpos = chXpos = 0;
                ssd1331_clear_gram();
            }
        }

        ssd1331_display_char(chXpos, chYpos, *pchString, chFontIndex, hwForeColor, hwBackColor);
        chXpos += fonts_width[chFontIndex];
        pchString++;
    }
}

void ssd1331_continuous_scrolling(unsigned char chYpos, unsigned char chHeight, unsigned char chDirection, unsigned char chInterval)
{
    if (chYpos >= SSD1331_WIDTH || (chYpos+chHeight) >= SSD1331_WIDTH) {
        return;
    }

//    ssd1331_write_byte(HORIZONTAL_SCROLLING_SETUP, SSD1331_CMD);
//    ssd1331_write_byte(chDirection, SSD1331_DATA);
//    ssd1331_write_byte(chYpos, SSD1331_DATA);
//    ssd1331_write_byte(chHeight, SSD1331_DATA);
//    ssd1331_write_byte(0x00, SSD1331_DATA);
//    ssd1331_write_byte(chInterval, SSD1331_DATA);

    ssd1331_write_byte(ACTIVATE_SCROLLING, SSD1331_CMD);
}

void ssd1331_deactivate_scrolling(void)
{
    ssd1331_write_byte(DEACTIVATE_SCROLLING, SSD1331_CMD);
}

void ssd1331_show_checkerboard(void)
{
    unsigned char i,j;

    ssd1331_write_byte(SET_COLUMN_ADDRESS, SSD1331_CMD);
    ssd1331_write_byte(0x00, SSD1331_CMD);
    ssd1331_write_byte(SSD1331_WIDTH - 1, SSD1331_CMD);

    ssd1331_write_byte(SET_ROW_ADDRESS, SSD1331_CMD);
    ssd1331_write_byte(0x00, SSD1331_CMD);
    ssd1331_write_byte(SSD1331_HEIGHT - 1, SSD1331_CMD);

    for (i=0; i<SSD1331_HEIGHT/2; i++) {
        for (j=0; j<SSD1331_WIDTH/2; j++) {
            ssd1331_write_byte(0xFF, SSD1331_DATA);
            ssd1331_write_byte(0xFF, SSD1331_DATA);
            ssd1331_write_byte(0x00, SSD1331_DATA);
            ssd1331_write_byte(0x00, SSD1331_DATA);
        }
        for (j=0; j<SSD1331_WIDTH/2; j++) {
            ssd1331_write_byte(0x00, SSD1331_DATA);
            ssd1331_write_byte(0x00, SSD1331_DATA);
            ssd1331_write_byte(0xFF, SSD1331_DATA);
            ssd1331_write_byte(0xFF, SSD1331_DATA);
        }
    }
}

void ssd1331_show_rainbow(void)
{
    // White => Column 0~11
    ssd1331_fill_rect(0x00, 0x00, 0x0C, SSD1331_HEIGHT, White);

    // Yellow => Column 12~23
    ssd1331_fill_rect(0x0C, 0x00, 0x0C, SSD1331_HEIGHT, Yellow);

    // Purple => Column 24~35
    ssd1331_fill_rect(0x18, 0x00, 0x0C, SSD1331_HEIGHT, Magenta);

    // Cyan => Column 36~47
    ssd1331_fill_rect(0x24, 0x00, 0x0C, SSD1331_HEIGHT, Cyan);

    // Red => Column 48~59
    ssd1331_fill_rect(0x30, 0x00, 0x0C, SSD1331_HEIGHT, Red);

    // Green => Column 60~71
    ssd1331_fill_rect(0x3C, 0x00, 0x0C, SSD1331_HEIGHT, Lime);

    // Blue => Column 72~83
    ssd1331_fill_rect(0x48, 0x00, 0x0C, SSD1331_HEIGHT, Blue);

    // Black => Column 84~95
    ssd1331_fill_rect(0x54, 0x00, 0x0C, SSD1331_HEIGHT, Black);
}

void ssd1331_set_gray_scale_table(void)
{
    ssd1331_write_byte(SET_GRAY_SCALE_TABLE, SSD1331_CMD);  // Set Pulse Width for Gray Scale Table
    ssd1331_write_byte(0x02, SSD1331_DATA);                 // Gray Scale Level 1
    ssd1331_write_byte(0x03, SSD1331_DATA);                 // Gray Scale Level 2
    ssd1331_write_byte(0x04, SSD1331_DATA);                 // Gray Scale Level 3
    ssd1331_write_byte(0x05, SSD1331_DATA);                 // Gray Scale Level 4
    ssd1331_write_byte(0x06, SSD1331_DATA);                 // Gray Scale Level 5
    ssd1331_write_byte(0x07, SSD1331_DATA);                 // Gray Scale Level 6
    ssd1331_write_byte(0x08, SSD1331_DATA);                 // Gray Scale Level 7
    ssd1331_write_byte(0x09, SSD1331_DATA);                 // Gray Scale Level 8
    ssd1331_write_byte(0x0A, SSD1331_DATA);                 // Gray Scale Level 9
    ssd1331_write_byte(0x0B, SSD1331_DATA);                 // Gray Scale Level 10
    ssd1331_write_byte(0x0C, SSD1331_DATA);                 // Gray Scale Level 11
    ssd1331_write_byte(0x0D, SSD1331_DATA);                 // Gray Scale Level 12
    ssd1331_write_byte(0x0E, SSD1331_DATA);                 // Gray Scale Level 13
    ssd1331_write_byte(0x0F, SSD1331_DATA);                 // Gray Scale Level 14
    ssd1331_write_byte(0x10, SSD1331_DATA);                 // Gray Scale Level 15
    ssd1331_write_byte(0x11, SSD1331_DATA);                 // Gray Scale Level 16
    ssd1331_write_byte(0x12, SSD1331_DATA);                 // Gray Scale Level 17
    ssd1331_write_byte(0x13, SSD1331_DATA);                 // Gray Scale Level 18
    ssd1331_write_byte(0x15, SSD1331_DATA);                 // Gray Scale Level 19
    ssd1331_write_byte(0x17, SSD1331_DATA);                 // Gray Scale Level 20
    ssd1331_write_byte(0x19, SSD1331_DATA);                 // Gray Scale Level 21
    ssd1331_write_byte(0x1B, SSD1331_DATA);                 // Gray Scale Level 22
    ssd1331_write_byte(0x1D, SSD1331_DATA);                 // Gray Scale Level 23
    ssd1331_write_byte(0x1F, SSD1331_DATA);                 // Gray Scale Level 24
    ssd1331_write_byte(0x21, SSD1331_DATA);                 // Gray Scale Level 25
    ssd1331_write_byte(0x23, SSD1331_DATA);                 // Gray Scale Level 26
    ssd1331_write_byte(0x25, SSD1331_DATA);                 // Gray Scale Level 27
    ssd1331_write_byte(0x27, SSD1331_DATA);                 // Gray Scale Level 28
    ssd1331_write_byte(0x2A, SSD1331_DATA);                 // Gray Scale Level 29
    ssd1331_write_byte(0x2D, SSD1331_DATA);                 // Gray Scale Level 30
    ssd1331_write_byte(0x30, SSD1331_DATA);                 // Gray Scale Level 31
    ssd1331_write_byte(0x33, SSD1331_DATA);                 // Gray Scale Level 32
    ssd1331_write_byte(0x36, SSD1331_DATA);                 // Gray Scale Level 33
    ssd1331_write_byte(0x39, SSD1331_DATA);                 // Gray Scale Level 34
    ssd1331_write_byte(0x3C, SSD1331_DATA);                 // Gray Scale Level 35
    ssd1331_write_byte(0x3F, SSD1331_DATA);                 // Gray Scale Level 36
    ssd1331_write_byte(0x42, SSD1331_DATA);                 // Gray Scale Level 37
    ssd1331_write_byte(0x45, SSD1331_DATA);                 // Gray Scale Level 38
    ssd1331_write_byte(0x48, SSD1331_DATA);                 // Gray Scale Level 39
    ssd1331_write_byte(0x4C, SSD1331_DATA);                 // Gray Scale Level 40
    ssd1331_write_byte(0x50, SSD1331_DATA);                 // Gray Scale Level 41
    ssd1331_write_byte(0x54, SSD1331_DATA);                 // Gray Scale Level 42
    ssd1331_write_byte(0x58, SSD1331_DATA);                 // Gray Scale Level 43
    ssd1331_write_byte(0x5C, SSD1331_DATA);                 // Gray Scale Level 44
    ssd1331_write_byte(0x60, SSD1331_DATA);                 // Gray Scale Level 45
    ssd1331_write_byte(0x64, SSD1331_DATA);                 // Gray Scale Level 46
    ssd1331_write_byte(0x68, SSD1331_DATA);                 // Gray Scale Level 47
    ssd1331_write_byte(0x6C, SSD1331_DATA);                 // Gray Scale Level 48
    ssd1331_write_byte(0x70, SSD1331_DATA);                 // Gray Scale Level 49
    ssd1331_write_byte(0x74, SSD1331_DATA);                 // Gray Scale Level 50
    ssd1331_write_byte(0x78, SSD1331_DATA);                 // Gray Scale Level 51
    ssd1331_write_byte(0x7D, SSD1331_DATA);                 // Gray Scale Level 52
    ssd1331_write_byte(0x82, SSD1331_DATA);                 // Gray Scale Level 53
    ssd1331_write_byte(0x87, SSD1331_DATA);                 // Gray Scale Level 54
    ssd1331_write_byte(0x8C, SSD1331_DATA);                 // Gray Scale Level 55
    ssd1331_write_byte(0x91, SSD1331_DATA);                 // Gray Scale Level 56
    ssd1331_write_byte(0x96, SSD1331_DATA);                 // Gray Scale Level 57
    ssd1331_write_byte(0x9B, SSD1331_DATA);                 // Gray Scale Level 58
    ssd1331_write_byte(0xA0, SSD1331_DATA);                 // Gray Scale Level 59
    ssd1331_write_byte(0xA5, SSD1331_DATA);                 // Gray Scale Level 60
    ssd1331_write_byte(0xAA, SSD1331_DATA);                 // Gray Scale Level 61
    ssd1331_write_byte(0xAF, SSD1331_DATA);                 // Gray Scale Level 62
    ssd1331_write_byte(0xB4, SSD1331_DATA);                 // Gray Scale Level 63
}

void ssd1331_init(void)
{
    SSD1331_PIN_SET();
    SSD1331_RES_SET();

