redchenjs/auto_curtain_controller_msp430/src/driver/ssd1331.c
    ssd1331_write_byte(SET_DISPLAY_OFF, SSD1331_CMD);           // Display Off

    ssd1331_write_byte(SET_REMAP_COLOR_DEPTH, SSD1331_CMD);     // Set Re-Map / Color Depth
    ssd1331_write_byte(0x72, SSD1331_CMD);                      // Set Horizontal Address Increment
    ssd1331_write_byte(SET_DISPLAY_START_LINE, SSD1331_CMD);    // Set Vertical Scroll by RAM
    ssd1331_write_byte(0x00, SSD1331_CMD);                      // Set Mapping RAM Display Start Line
    ssd1331_write_byte(SET_DISPLAY_OFFSET, SSD1331_CMD);        // Set Vertical Scroll by Row
    ssd1331_write_byte(0x00, SSD1331_CMD);                      // Shift Mapping RAM Counter

    ssd1331_write_byte(SET_NORMAL_DISPLAY, SSD1331_CMD);        // Normal Display Mode

    ssd1331_write_byte(SET_MULTIPLEX_RATIO, SSD1331_CMD);       // Set Multiplex Ratio
    ssd1331_write_byte(0x3F, SSD1331_CMD);                      // 1/128 Duty
    ssd1331_write_byte(SET_MASTER_CONFIG, SSD1331_CMD);         // Master Contrast Configuration
    ssd1331_write_byte(0x8E, SSD1331_CMD);                      // Maximum
    ssd1331_write_byte(SET_POWER_SAVE_MODE, SSD1331_CMD);       // Set Power Saving Mode
    ssd1331_write_byte(0x0B, SSD1331_CMD);                      // Disable Power Saving Mode
    ssd1331_write_byte(SET_PHASE_PERIOD_ADJ, SSD1331_CMD);      // Set Reset (Phase1)/Pre-charge (Phase 2) period
    ssd1331_write_byte(0x31, SSD1331_CMD);                      // 0x31
    ssd1331_write_byte(SET_DISPLAY_CLOCK_DIV, SSD1331_CMD);     // Set Display Clock Divider / Oscillator Frequency
    ssd1331_write_byte(0xF0, SSD1331_CMD);                      // 0xF0

    ssd1331_write_byte(SET_PRECHARGE_SPEED_A, SSD1331_CMD);     // Set Second Pre-charge Speed of Color A
    ssd1331_write_byte(0x64, SSD1331_CMD);                      // 100
    ssd1331_write_byte(SET_PRECHARGE_SPEED_B, SSD1331_CMD);     // Set Second Pre-charge Speed of Color B
    ssd1331_write_byte(0x78, SSD1331_CMD);                      // 120
    ssd1331_write_byte(SET_PRECHARGE_SPEED_C, SSD1331_CMD);     // Set Second Pre-charge Speed of Color C
    ssd1331_write_byte(0x64, SSD1331_CMD);                      // 100

    ssd1331_write_byte(SET_PRECHARGE_LEVEL, SSD1331_CMD);       // Set Pre-charge Level
    ssd1331_write_byte(0x3A, SSD1331_CMD);                      // 0x3A
    ssd1331_write_byte(SET_VCOMH_VOLTAGE, SSD1331_CMD);         // Set COM Deselect Voltage Level
    ssd1331_write_byte(0x3E, SSD1331_CMD);                      // 0.83*VCC
    ssd1331_write_byte(SET_MASTER_CURRENT, SSD1331_CMD);        // Master Contrast Current Control
    ssd1331_write_byte(0x0F, SSD1331_CMD);                      // Maximum

    ssd1331_write_byte(SET_CONTRAST_A, SSD1331_CMD);            // Set Contrast Current for Color A
    ssd1331_write_byte(0x91, SSD1331_CMD);                      // 145 0x91
    ssd1331_write_byte(SET_CONTRAST_B, SSD1331_CMD);            // Set Contrast Current for Color B
    ssd1331_write_byte(0x50, SSD1331_CMD);                      // 80 0x50
    ssd1331_write_byte(SET_CONTRAST_C, SSD1331_CMD);            // Set Contrast Current for Color C
    ssd1331_write_byte(0x7D, SSD1331_CMD);                      // 125 0x7D

    ssd1331_write_byte(SET_BUILTIN_LINEAR_LUT, SSD1331_CMD);    // Default
    ssd1331_set_gray_scale_table();                             // Set Pulse Width for Gray Scale Table

    ssd1331_clear_gram();

    ssd1331_write_byte(SET_DISPLAY_ON_NORMAL, SSD1331_CMD);     // Display On
}
